[
    {
        "content": "Saya mengikuti kembali pelajaran \"Buat Aplikasi PPOB dengan 1 Bahasa\" di Dusun Web untuk memperdalam web programming dengan belajar bahasa javascript untuk back end dan front endnya (fullstack js). Selama 12 pertemuan ini, alhamdulillah saya bisa mengerti dan bisa membuat aplikasi ppob dengan framework javascript AdonisJS dengan Vue JS. Semoga kedepannya saya dapat membuat aplikasi e-commerce dengan menggunakan framework javascript.",
        "author": "Pandi Apriyandi",
        "role": "IT Manager",
        "location": "Jakarta"
    },
    {
        "content": "Bismillah, Terima Kasih Banyak untuk Mas Elvis Sonata Yang telah memberikan ilmu codingnya \"Program Fullstack Javascript\" tanggal 19 Oktober 2019 Semoga bermanfaat bagi kami untuk memasuki dunia industri 5.0. Kesan yang kami dapatkan adalah Pertama materi yang dibahas sangat bermanfaat sekali dan dipakai di dunia industri saat ini dan result dari pembelajaran sudah berbentuk sebuah projek sehingga bisa kami gunakan sebagai portofolio, Kedua Pemaparan Materi sangat mudah kami pahami. Semoga Kedepannya ada lagi materi materi yang berkaitan satu sama lain sehingga memantabkan kami di dunia persilatan \"coding\" ... Semoga Dusun Web sukses dan banyak mencetak developer developer tangguh dan bertanggung jawab.",
        "author": "Aria Nanda",
        "role": "Devops",
        "location": "Banten"
    },
    {
        "content": "Kesan selama saya mengikuti kursus di Dusun Web ini adalah pengajar yang sangat sabar dalam menjelaskan semua materi secara interaktif dan terstruktur. Dengan mengikuti kursus Fullstack JavaScript di Dusun Web pengalaman saya menjadi lebih banyak seputar dunia IT, Makin banyak pengetahuan dan istilah baru seputar dunia IT. Sebelumnya saya belum tau apa itu Coding ?, Framework ?, Logical JavaScript ? dll, Namun dengan adanya kelas ini saya menjadi faham bahwa ilmu IT itu harus disusun dengan struktuk baik.",
        "author": "Destria",
        "role": "SMK",
        "location": "Bekasi"
    },
    {
        "content": "Alhamdulillah, saya telah menyelesaikan kursus koding di Dusun Web. Kesan selama belajar disini: belajar programming di sini sangat nyaman dengan pengajar yang sangat berpengalaman dalam hal programming. Pengajarannya pun di jelaskan secara rinci, sehingga saya dapat mengingat pelajaran logika dulu semasa kuliah. Pengajar juga menceritakan pengalamannya selama ini kepada kami, sehingga membuka pikiran saya lebih luas lagi. Baik itu dalam hal pemrograman maupun pengalaman dulu sewaktu beliau baru memulai karir sebagai programmer. Ditambah lagi ada pembelajaran agama yang beliau bagikan di sela sela ceritanya. Intinya, belajar disini sangat menyenangkan. Semoga Dusun Web semakin maju. Aamiin.",
        "author": "Arif Budiman",
        "role": "",
        "location": "Padang"
    },
    {
        "content": "Alhamdulillah bisa bergabung di dusun web. Dimana saya bukan cuman belajar teknis, tapi juga konsep yang membuat saya lebih faham dengan teknologi yang selalu berubah. Hal menarik yang bisa saya dapatkan di sini adalah ilmu diniyah, yang membuat saya faham bahwa ilmu dunia tidak akan berarti tanpa diimbangi ilmu agama. Barakallahu fik.",
        "author": "Hermansyah",
        "role": "Devops",
        "location": "Kalimantan"
    },
    {
        "content": "Bismillahirrahmanirrahim. Kesan selama saya bergabung di dusun web sebagai pengajar ilmu bahasa arab (sharaf dan nahwu) alhamdulillah, dan juga sangat berterima kasih kepada teman-teman yg banyak memberikan nasehat demi nasehat kepada saya pribadi sehingga saya bisa mengambil banyak ibroh yang besar, bagaimana menjadi seorang pemimpin, meskipun saya sebagai pengajar di dusun web masih jauh dari yg di harapkan, tapi saya tetap berusaha untuk menjadi lebih baik, sehingga bisa memberi teladan yg baik bagi teman-teman. Dan yg kedua, saya sangat berterima kasih semenjak di dusun web saya bisa belajar ilmu ruqyah. Dan banyak sekali ilmu-ilmu yg saya dapatkan semenjak bergabung di dusun web.",
        "author": "Miftahul Arifin",
        "role": "Mentor",
        "location": "Madura"
    },
    {
        "content": "Kesan selama di dusunweb: Belajar programming di dusun web nyaman banget. Pengajarnya sangat berpengalaman dalam hal programming. Cara mengajarnya pun sabar banget dalam menjelaskan setiap materi yang diajarkan secara rinci dan terstruktur. Pengajar mengarahkan banyak hal tentang apa saja yang dibutuhkan untuk belajar web programming sekarang ini. Cara pengajarannya pun unik, beda dari yang lain. Ruangannya bersih dan rapi, sehingga membuat suasana belajar menjadi nyaman. Dusun web cocok banget bagi siapapun yang ingin belajar mengenai web programming dengan latar belakang IT maupun non-IT. Ditambah lagi disini mendapatkan bonus ilmu agama yang sangat berharga untuk kita amalkan dalam kehidupan kita sehari-harinya.",
        "author": "Efriliawan Noor",
        "role": "Muamalat Karyawan",
        "location": "Yogyakarta"
    },
    {
        "content": "Kesan selama saya mengikuti kursus di dusunweb ini adalah pengajar yang sangat sabar dalam menjelaskan semua materi secara detail dan terstruktur, sehingga mudah dipahami oleh kami semua. Selain mendapatkan ilmu yang diberikan selama kursus programming, kami juga mendapatkan ilmu agama yang sangat penting sekali dalam kehidupan kita seperti belajar bahasa arab, ruqyah, hafalan al qur’an dan hadits. Di tempat kursus kami, juga mendapatkan fasilitas lain berupa penginapan khusus untuk program 1 tahun, makan siang dan snack yang enak. Suasana ruangan sangat bersih, rapi, dan nyaman sehingga membuat suasana belajar lebih kondusif. Dusun Web merupakan tempat kursus yang sangat recommended bagi para mahasiswa, dan yang baru lulus SMA & SMK dari yang jauh maupun dekat dari jakarta, yang sudah mempunyai pekerjaan juga sangat cocok, yang ingin memahami materi pemrograman secara lebih detail.",
        "author": "Ragil Ramadhan",
        "role": "Frontend Developer",
        "location": "Indramayu"
    },
    {
        "content": "Selama belajar di Dusun Web, kami mendapat banyak ilmu pemrograman tetapi bukan hanya ilmu pemrograman saja, disana kami juga mendapat pengobatan ruqyah yang membuat hati menjadi tenang dan belajar menjadi lebih fokus, terima kasih Dusun Web.",
        "author": "Rakhriyal Riyandi",
        "role": "SMK",
        "location": "Sukabumi"
    },
    {
        "content": "Alhamdulillah setelah saya bergabung bersama dusun web, saya menjadi mengetahui banyak hal, bukan hanya skill dalam dunia IT saja yang bertambah, tetapi ilmu keagamaan saya juga bertambah, sebelumnya saat belajar di sekolah, susah sekali pelajaran yang guru berikan masuk ke dalam otak saya, tetapi setelah saya masuk ke dusun web saya diruqyah dan alhamdulillah hati saya menjadi semakin tenang dan pelajaran pun mudah diserap. Terima Kasih Dusun Web.",
        "author": "Ahmad Zaini",
        "role": "SMK",
        "location": "Sukabumi"
    },
    {
        "content": "Selama mengikuti pembelajaran di Dusun Web, pengajar nya sabar dalam mengajar. Menjelaskan materi secara detail, selain belajar ilmu komputer di Dusun Web juga kami mendapatkan ilmu agama dan salah satunya Ruqyah. Kami belajar bagaimana caranya meruqyah orang, meruqyah diri sendiri (Ruqyah Mandiri). Kurang lebihnya seperti itu untuk lebih jelasnya silahkan bergabung di DusunWeb.",
        "author": "Dimas Anugrah",
        "role": "SMK",
        "location": "Sukabumi"
    },
    {
        "content": "Alhamdulillah saya bisa bergabung sebagai pelajar di Dusun Web, yang mana pengajar disini sangat sabar dalam membimbing dan menjelaskan semua materi kepada kami, sehingga materi itu dapat dengan mudah dipahami. Dalam proses belajar ilmu pemrograman kita tidak langsung di tekan untuk membuat project besar, tapi kita benar-benar akan dikuatkan dalam logika pemrograman yang mana itu sangat membantu untuk proses belajar selanjutnya. Tidak hanya ilmu teknologi dan perograman, tapi kita juga diajarkan ilmu diniyyah (agama) disini, dan uniknya disini ada kelas ruqyah yang mana kita diajarkan konsep dasar dan juga bagaimana proses ruqyah, tidak hanya diajarkan cara ruqyah orang lain tapi juga kita diajarkan cara meruqyah menggunakan metode mandiri yang mana itu sangat membantu dalam proses pembelajaran karena saya bisa lebih fokus. Terima kasih.",
        "author": "Syarif Aditya",
        "role": "SMK",
        "location": "Sukabumi"
    }
]